app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist=Artist.find_by(id: params[:artist_id])
      if @artist
        @songs = @artist.songs
      else
        flash[:alert] = 'Artist not found'
        redirect_to artists_path
      end
    else
      @songs=Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
      @song = Song.find_by(id: params[:id])
      if @song==nil
        flash[:alert]="Song not found"
        redirect_to artist_songs_path(params[:artist_id])
      end
      @artist= Artist.find_by(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 12345]]
SELECT  "artists".* FROM "artists" WHERE (5) LIMIT 1